onec-mid-base-11/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>юб_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.юб_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>юб_СогласованнаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/CommonModules/юб_ДоработкаФормДокументов/Module.bsl
Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	Если СтрЗаканчиваетсяНа(ИмяФормы, "ФормаДокумента") Тогда
		
		ДобавитьПолеКонтактноеЛицо(Форма);
		
		Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
			ДобавитьСогласованнаяСкидка(Форма);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 

Процедура ДобавитьПолеКонтактноеЛицо(Форма)
	
	ИмяДокумента = СтрРазделить(Форма.ИмяФормы, ".")[1];
		
	Если ИмяДокумента = "ЗаказПокупателя" Или 
		ИмяДокумента = "ПоступлениеТоваровУслуг" Или 
			ИмяДокумента = "РеализацияТоваровУслуг" Тогда
		ПолеКонтактноеЛицо = Форма.Элементы.Добавить("юб_КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ИначеЕсли ИмяДокумента = "ОплатаОтПокупателя" Тогда
		ПолеКонтактноеЛицо = Форма.Элементы.Вставить("юб_КонтактноеЛицо", Тип("ПолеФормы"),,Форма.Элементы.Основание);
	ИначеЕсли ИмяДокумента = "ОплатаПоставщику" Тогда
		ПолеКонтактноеЛицо = Форма.Элементы.Вставить("юб_КонтактноеЛицо", Тип("ПолеФормы"),,Форма.Элементы.СуммаДокумента);
	Иначе
		Возврат;
	КонецЕсли;
	
	ПолеКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
	ПолеКонтактноеЛицо.ПутьКДанным = "Объект.юб_КонтактноеЛицо";
	
	НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент");
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НоваяСвязь);
	НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
	Форма.Элементы.юб_КонтактноеЛицо.СвязиПараметровВыбора = НовыеСвязи;
	
КонецПроцедуры 

Процедура ДобавитьСогласованнаяСкидка(Форма)
	
	ГруппаСкидка = Форма.Элементы.Добавить("ГруппаОбычная", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);
	ГруппаСкидка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСкидка.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаСкидка.ОтображатьЗаголовок = ЛОЖЬ; 
	ГруппаСкидка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ПолеСогласованнаяСкидка = Форма.Элементы.Добавить("юб_СогласованнаяСкидка", Тип("ПолеФормы"), ГруппаСкидка);
	ПолеСогласованнаяСкидка.Вид = ВидПоляФормы.ПолеВвода;
	ПолеСогласованнаяСкидка.ПутьКДанным = "Объект.юб_СогласованнаяСкидка";
	ПолеСогласованнаяСкидка.УстановитьДействие("ПриИзменении", "юб_СогласованнаяСкидкаПриИзменении");
	
	КомандаПересчитатьТаблицу = Форма.Команды.Добавить("юб_ПересчитатьТаблицу");
	КомандаПересчитатьТаблицу.Заголовок = "ПересчитатьТаблицу";
	КомандаПересчитатьТаблицу.Действие = "юб_ПересчитатьТаблицу";    
	
	КнопкаПересчитатьТаблицу = Форма.Элементы.Добавить("юб_ПересчитатьТаблицу", Тип("КнопкаФормы"), ГруппаСкидка);
	КнопкаПересчитатьТаблицу.ИмяКоманды = "юб_ПересчитатьТаблицу";
	КнопкаПересчитатьТаблицу.Отображение = ОтображениеКнопки.КартинкаИТекст;
	КнопкаПересчитатьТаблицу.Картинка = БиблиотекаКартинок.Перечитать;
		
КонецПроцедуры
